
# Index


1. Introduction
    - Frequently used variables
        - string: print, word extraction, word inclusion
        - list
        - dictionary 
    - Basic operations: for loop
    - Define functions
    - (creating object)
2. Libraries for data manipulation
    - NumPy: linear algebra
    - Pandas: data frame
    - Datetime
    - OS: directory access
    - Wanings: filter warnings
3. Data Prepartion
    - Set the path to your directory
    - Read local .csv files
    - Read local .xlsx files (with or without tabs)
- Create a pd.DataFrame
- Check the first/last n rows
- Check the summary: mean, median, variance, max, min

# 1. Introduction

##### Frequently used variables

- String

In [27]:
some_word = 'hello I am Go Ito, the author of this note :)'

In [28]:
print(some_word)

hello I am Go Ito, the author of this note :)

In [34]:
print('Extract first 5 letters: ',some_word[0:5])
print('Extract the last 12 letters: ', some_word[-12:])

Extract first 5 letters:  hello
Extract the last 12 letters:  this note :)

In [30]:
'Go Ito' in some_word

True

# 2. Libraries for data manipulation

##### NumPy
- Used for linear algebra: matrix calculation, vector calculation etc.
- Typically renamed as 'np' for the eaze.

In [ ]:
import numpy as np

##### Pandas
- The most frequently used library for data science.
- Tool set for data manipulation, including: merging multiple data, concatinating multiple data, melting the data structure, replacing NA, dropping duplicates etc.
- Also contain the functions to detect missing values.
- Typically renamed as 'pd' for the eaze.

In [ ]:
import pandas as pd

##### Datetime
- Used to convert string data into a 'datetime object', a type of object that enables users to conviniently handle date-time information.
- Likewise, convert datetime object into a string data.
- Allows users to obtain: today's date, weekday, week number, year etc. at any granular level of users'choice.

In [2]:
from datetime import datetime

### OS
- Used to set your working directory (the folder location that input/output files are stored primarily).

In [ ]:
import os

### Warnings
- Ignore the redundant warnings

In [5]:
import warnings

# 3. Data Preparation

##### Set the path to your directory
- Two ways:
    1. Make a string variable that the path to your directory is indicated, then use the variable anytime the access to a certain directory is needed.
    2. Use os.chdir(path) to change your entire working directory.
    
- Make sure to use double slash ('\\\\') to locate the further path.

Method 1 is highly recommended due to its readability, safety, and flexibility.
In this note, we are using the method 1.

In [18]:
### 1.
path = 'C:\\Users\\ITOG003\\Documents\\GitHub\\Python-Data-Manipulation-Note'

In [ ]:
### 2.
#os.chdir('C:\\Users\\ITOG003\\Documents\\GitHub\\Python-Data-Manipulation-Note')

##### Read local .csv file

In [19]:
iris_csv = pd.read_csv(path + '\\' + 'iris.csv')

##### Read local .xlsx file with tabs

1. Store the entire excel sheets into a variable

In [21]:
iris_excel = pd.ExcelFile(path + '\\' + 'iris.xlsx')

2. Read individual tabs one-by-one.

In [26]:
sepal = pd.read_excel(iris_excel, sheets='Sepal')
petal = pd.read_excel(iris_excel, sheets='Petal')
species = pd.read_excel(iris_excel, sheets='Species')

In [13]:
pd.concat([species, yesno], axis=1).to_csv('species_yesno.csv')

In [10]:
iris.to_csv('iris.csv', index=False)

# Data Prepatation

In [6]:
import numpy as np
import pandas as pd
import random
from sklearn import datasets

In [7]:
iris = datasets.load_iris()
species = iris.target
yesno = np.random.randint(2, size=len(species))
index = np.arange(len(species))
iris = pd.DataFrame(iris.data)
species = pd.DataFrame(species)
yesno = pd.DataFrame(yesno)
index = pd.DataFrame(index)
species = species.replace({0:'setosa', 1:'versicolor', 2:'verginica'})

# concat()
Combine multiple dataframe with the same number of rows column-wise (axis=1), or same number of column row-wise(axis=0).

#### Column-wise

In [3]:
iris = pd.concat([index.reset_index(drop=True), iris], axis=1)
iris = pd.concat([iris.reset_index(drop=True), species], axis=1)
iris = pd.concat([iris.reset_index(drop=True), yesno], axis=1)
iris.columns = ['index', 'sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species', 'yes_no']

In [59]:
iris.head()

   index  sepal_length  sepal_width  petal_length  petal_width species  yes_no
0      0           5.1          3.5           1.4          0.2  setosa       1
1      1           4.9          3.0           1.4          0.2  setosa       1
2      2           4.7          3.2           1.3          0.2  setosa       1
3      3           4.6          3.1           1.5          0.2  setosa       1
4      4           5.0          3.6           1.4          0.2  setosa       0

#### Row-wise

In [57]:
pd.concat([iris.head(2).reset_index(drop=True), iris], axis=0).head()

   index  sepal_length  sepal_width  petal_length  petal_width species  yes_no
0      0           5.1          3.5           1.4          0.2  setosa       1
1      1           4.9          3.0           1.4          0.2  setosa       1
0      0           5.1          3.5           1.4          0.2  setosa       1
1      1           4.9          3.0           1.4          0.2  setosa       1
2      2           4.7          3.2           1.3          0.2  setosa       1

# merge()
Merge two distinct data files. Inner, outer, left, or right.

Preparing some data

In [62]:
ints = np.vectorize(lambda l: random.randint(3,10))
some_index = pd.DataFrame(ints(np.zeros(30)))
some_values = pd.DataFrame(ints(np.zeros(30)))
some_data = pd.concat([some_index.reset_index(drop=True),some_values], axis=1)
some_data.columns = ['index', 'some_values']
some_data.head()

   index  some_values
0      3            5
1      4           10
2      6            4
3      6            7
4      6            5

#### Left Join

In [65]:
iris.merge(some_data, on=['index'], how='left').head()

,index,sepal_length,sepal_width,petal_length,petal_width,species,yes_no,some_values
0,0,5.1,3.5,1.4,0.2,setosa,1,NaN
1,1,4.9,3.0,1.4,0.2,setosa,1,NaN
2,2,4.7,3.2,1.3,0.2,setosa,1,NaN
3,3,4.6,3.1,1.5,0.2,setosa,1,5.0
4,3,4.6,3.1,1.5,0.2,setosa,1,9.0

#### Right Join

In [66]:
iris.merge(some_data, on=['index'], how='right').head()

,index,sepal_length,sepal_width,petal_length,petal_width,species,yes_no,some_values
0,3,4.6,3.1,1.5,0.2,setosa,1,5
1,3,4.6,3.1,1.5,0.2,setosa,1,9
2,3,4.6,3.1,1.5,0.2,setosa,1,7
3,3,4.6,3.1,1.5,0.2,setosa,1,5
4,3,4.6,3.1,1.5,0.2,setosa,1,3

#### Inner Join

In [64]:
iris.merge(some_data, on=['index'], how='inner').head()

,index,sepal_length,sepal_width,petal_length,petal_width,species,yes_no,some_values
0,3,4.6,3.1,1.5,0.2,setosa,1,5
1,3,4.6,3.1,1.5,0.2,setosa,1,9
2,3,4.6,3.1,1.5,0.2,setosa,1,7
3,3,4.6,3.1,1.5,0.2,setosa,1,5
4,3,4.6,3.1,1.5,0.2,setosa,1,3

#### Outer Join

In [67]:
iris.merge(some_data, on=['index'], how='outer').head()

,index,sepal_length,sepal_width,petal_length,petal_width,species,yes_no,some_values
0,0,5.1,3.5,1.4,0.2,setosa,1,NaN
1,1,4.9,3.0,1.4,0.2,setosa,1,NaN
2,2,4.7,3.2,1.3,0.2,setosa,1,NaN
3,3,4.6,3.1,1.5,0.2,setosa,1,5.0
4,3,4.6,3.1,1.5,0.2,setosa,1,9.0

# describe()
Output summary statistics.

In [36]:
iris.describe()

,index,sepal_length,sepal_width,petal_length,petal_width,yes_no
count,150.000000,150.000000,150.000000,150.000000,150.000000,150.000000
mean,74.500000,5.843333,3.057333,3.758000,1.199333,0.500000
std,43.445368,0.828066,0.435866,1.765298,0.762238,0.501675
min,0.000000,4.300000,2.000000,1.000000,0.100000,0.000000
25%,37.250000,5.100000,2.800000,1.600000,0.300000,0.000000
50%,74.500000,5.800000,3.000000,4.350000,1.300000,0.500000
75%,111.750000,6.400000,3.300000,5.100000,1.800000,1.000000
max,149.000000,7.900000,4.400000,6.900000,2.500000,1.000000

# groupby()
Group the dataset by desired categorical variables and aggregate numerical variables by desired functions (e.g. mean, sd, max, min, head(1) etc...)

In [5]:
# group by categorical columns
iris_groupby = iris.groupby(['species'])['sepal_length', 'petal_length'].mean().reset_index()
iris_groupby

      species  sepal_length  petal_length
0      setosa         5.006         1.462
1   verginica         6.588         5.552
2  versicolor         5.936         4.260

In [6]:
# combine multiple columns with aggrgate fuctions (i.e. the most efficient ways to collapse multiple columns)
# even works for string (e.g. first name and last name), but probably easier just by using '+' operator.
mapping = {'sepal_length':'length',
          'sepal_width':'width',
          'petal_length':'length',
          'petal_width':'width'}
iris.set_index('index').groupby(mapping, axis=1).sum().reset_index().head()

   index  length  width
0      0     6.5    3.7
1      1     6.3    3.2
2      2     6.0    3.4
3      3     6.1    3.3
4      4     6.4    3.8

Multiple Aggregated Functions

In [31]:
mapping = {'sepal_length':['sum', 'max'],
 'sepal_width':'mean', 
 'petal_length':'sum', 
 'petal_width': lambda x: x.max() - x.min()}
iris.groupby('yes_no').agg(mapping)

       sepal_length      sepal_width petal_length petal_width
                sum  max        mean          sum    <lambda>
yes_no
0             439.5  7.7    3.029333        289.0         2.4
1             437.0  7.9    3.085333        274.7         2.4

# pivot_table()
Very similar to groupby(), except we can choose multiple categorical variables. It is also used to spread a column into multiple columns.

In [7]:
iris.pivot_table(values=['sepal_length', 'petal_length'], index=['yes_no', 'species'], aggfunc=np.mean)

                   petal_length  sepal_length
yes_no species
0      setosa          1.447619      5.009524
       verginica       5.575000      6.633333
       versicolor      4.160000      5.836667
1      setosa          1.472414      5.003448
       verginica       5.530769      6.546154
       versicolor      4.410000      6.085000

In [8]:
# identical to the above one, except for the column order
iris.pivot_table(values=['sepal_length', 'petal_length'], index=['species'], aggfunc=np.mean)

            petal_length  sepal_length
species
setosa             1.462         5.006
verginica          5.552         6.588
versicolor         4.260         5.936

# melt()
collapse multiple columns into a new column.

In [9]:
iris_groupby

      species  sepal_length  petal_length
0      setosa         5.006         1.462
1   verginica         6.588         5.552
2  versicolor         5.936         4.260

In [10]:
# equivalent to gather() from R:tidyr
iris_melt = iris_groupby.melt(id_vars='species', var_name='sepal_petal',  value_name='length')
iris_melt

      species   sepal_petal  length
0      setosa  sepal_length   5.006
1   verginica  sepal_length   6.588
2  versicolor  sepal_length   5.936
3      setosa  petal_length   1.462
4   verginica  petal_length   5.552
5  versicolor  petal_length   4.260

To put the above table into the original form, use pivot_table() with "columns" argument. Equivalent to spread() from R:tidyr.

In [11]:
iris_melt.pivot_table(values='length', index=['species'], columns='sepal_petal')

sepal_petal  petal_length  sepal_length
species
setosa              1.462         5.006
verginica           5.552         6.588
versicolor          4.260         5.936

# str.split()
Split a string column into multiple columns. Useful when you have name or dates. Use groupby() to put them back.

In [12]:
iris_str = iris['species'].str.split('e', n = 1, expand = True)
iris_str = pd.concat([iris.drop('species', axis=1).reset_index(drop=True), iris_str], axis=1)
iris_str.head()

,index,sepal_length,sepal_width,petal_length,petal_width,yes_no,0,1
0,0,5.1,3.5,1.4,0.2,1,s,tosa
1,1,4.9,3.0,1.4,0.2,1,s,tosa
2,2,4.7,3.2,1.3,0.2,1,s,tosa
3,3,4.6,3.1,1.5,0.2,1,s,tosa
4,4,5.0,3.6,1.4,0.2,0,s,tosa

In [13]:
# Put the string columnns back i.e. combine
iris_str['species'] = iris_str[0] + 'e' + iris_str[1]
iris_str.drop([0,1], axis=1).head()

   index  sepal_length  sepal_width  petal_length  petal_width  yes_no species
0      0           5.1          3.5           1.4          0.2       1  setosa
1      1           4.9          3.0           1.4          0.2       1  setosa
2      2           4.7          3.2           1.3          0.2       1  setosa
3      3           4.6          3.1           1.5          0.2       1  setosa
4      4           5.0          3.6           1.4          0.2       0  setosa

# sort_values()
Sort by a selected column.

In [38]:
# ascendig (default)
iris.sort_values('sepal_length').head()

,index,sepal_length,sepal_width,petal_length,petal_width,species,yes_no
13,13,4.3,3.0,1.1,0.1,setosa,0
42,42,4.4,3.2,1.3,0.2,setosa,1
38,38,4.4,3.0,1.3,0.2,setosa,1
8,8,4.4,2.9,1.4,0.2,setosa,1
41,41,4.5,2.3,1.3,0.3,setosa,1

In [39]:
# descending
iris.sort_values('sepal_length', ascending = False).head()

,index,sepal_length,sepal_width,petal_length,petal_width,species,yes_no
131,131,7.9,3.8,6.4,2.0,verginica,1
135,135,7.7,3.0,6.1,2.3,verginica,0
122,122,7.7,2.8,6.7,2.0,verginica,1
117,117,7.7,3.8,6.7,2.2,verginica,0
118,118,7.7,2.6,6.9,2.3,verginica,0

# crosstab()
Often used for a confusion matrix.

In [14]:
pd.crosstab(iris["species"],iris["yes_no"],margins=True)

yes_no       0   1  All
species
setosa      21  29   50
verginica   24  26   50
versicolor  30  20   50
All         75  75  150

# One-Hot Encoding
Expand categorical variables into new variables of binaries. This is REQUIRED if one is to apply machine-learning algorithms (except for LightGBM).

In [15]:
# One way
iris_1 = pd.get_dummies(iris)
iris_1.head()

,index,sepal_length,sepal_width,petal_length,petal_width,yes_no,species_setosa,species_verginica,species_versicolor
0,0,5.1,3.5,1.4,0.2,1,1,0,0
1,1,4.9,3.0,1.4,0.2,1,1,0,0
2,2,4.7,3.2,1.3,0.2,1,1,0,0
3,3,4.6,3.1,1.5,0.2,1,1,0,0
4,4,5.0,3.6,1.4,0.2,0,1,0,0

In [16]:
# Most popular way
from sklearn.preprocessing import OneHotEncoder
enc = OneHotEncoder(handle_unknown='ignore')
iris_2 = enc.fit_transform(iris)
iris_2.toarray()

array([[1., 0., 0., ..., 0., 0., 1.],
       [0., 1., 0., ..., 0., 0., 1.],
       [0., 0., 1., ..., 0., 0., 1.],
       ...,
       [0., 0., 0., ..., 0., 1., 0.],
       [0., 0., 0., ..., 0., 1., 0.],
       [0., 0., 0., ..., 0., 0., 1.]])

# Select columns

In [21]:
cols = ['sepal_length', 'petal_length']
iris[cols].head()

   sepal_length  petal_length
0           5.1           1.4
1           4.9           1.4
2           4.7           1.3
3           4.6           1.5
4           5.0           1.4

# Select rows with conditions: .loc[]

In [23]:
indices = [1,2,5,6,7,10]
iris.loc[indices]

,index,sepal_length,sepal_width,petal_length,petal_width,species,yes_no
1,1,4.9,3.0,1.4,0.2,setosa,1
2,2,4.7,3.2,1.3,0.2,setosa,1
5,5,5.4,3.9,1.7,0.4,setosa,1
6,6,4.6,3.4,1.4,0.3,setosa,0
7,7,5.0,3.4,1.5,0.2,setosa,1
10,10,5.4,3.7,1.5,0.2,setosa,1

In [27]:
iris.loc[iris.loc[:,'yes_no']==1].head()

   index  sepal_length  sepal_width  petal_length  petal_width species  yes_no
0      0           5.1          3.5           1.4          0.2  setosa       1
1      1           4.9          3.0           1.4          0.2  setosa       1
2      2           4.7          3.2           1.3          0.2  setosa       1
3      3           4.6          3.1           1.5          0.2  setosa       1
5      5           5.4          3.9           1.7          0.4  setosa       1

# Column-wise operation

In [29]:
length_ratio = iris.loc[:,'sepal_length']/iris.loc[:,'petal_length']
length_ratio[0:5]

0    3.642857
1    3.500000
2    3.615385
3    3.066667
4    3.571429
dtype: float64

# apply() and vectorize()
Used when each element of columns (or a vector) is to be applied by a function.

In [18]:
iris[['sepal_length', 'petal_length']].apply(lambda l: np.square(l)).head()

   sepal_length  petal_length
0         26.01          1.96
1         24.01          1.96
2         22.09          1.69
3         21.16          2.25
4         25.00          1.96

In [19]:
sq = np.vectorize(lambda l: np.square(l))
sq(iris['sepal_length'].to_numpy())[0:5]

array([26.01, 24.01, 22.09, 21.16, 25.  ])